#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.my_aws_ami: Reading...
data.aws_availability_zones.available: Reading...
aws_s3_bucket.backend: Refreshing state... [id=backend-onprem-migrationlab]
aws_kms_key.mykey: Refreshing state... [id=0cc4cdbd-f121-4749-8136-a41a48792bcc]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08cbc8929eed4e3d4]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
data.aws_ami.my_aws_ami: Read complete after 1s [id=ami-02d8f13fe48708be8]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d2ffc2f27abd596e]
aws_security_group.app: Refreshing state... [id=sg-009f3bf5545a03f6b]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-05af89243c3f0ea4d]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0b7f4d31d0958d160]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e7f938c78faf67cf]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b74175ae7776f29a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-066a4891010074389]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b962c0b429b42a38]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb3d5ca5e0b7a126]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04056cf8f32680271]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ac47f1345d44450e]
aws_security_group.db: Refreshing state... [id=sg-07b1c6fae7ccd5643]
aws_s3_bucket_versioning.this: Refreshing state... [id=backend-onprem-migrationlab]
aws_s3_bucket_server_side_encryption_configuration.kms: Refreshing state... [id=backend-onprem-migrationlab]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0066515e5af96adbf]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-092f71a7afb26c881]
aws_network_interface.app: Refreshing state... [id=eni-03cd8ce695aa1bdbf]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0182bdfbef02ab2b5]
aws_instance.db: Refreshing state... [id=i-0411a891660e3d4da]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fbd0ca005e63436e]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-028d5f496b7920a2f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ac47f1345d44450e1080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04e3d3b7b404e3f3e]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bb3d5ca5e0b7a1261080289494]
aws_instance.app: Refreshing state... [id=i-08b0cdd01cad899cd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.app must be replaced
-/+ resource "aws_instance" "app" {
      ~ ami                                  = "ami-066841d983164f7f6" -> "ami-02d8f13fe48708be8" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-1:294268556398:instance/i-08b0cdd01cad899cd" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "eu-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-08b0cdd01cad899cd" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-03cd8ce695aa1bdbf" -> (known after apply)
      ~ private_dns                          = "ip-172-16-0-50.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.16.0.50" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      ~ subnet_id                            = "subnet-066a4891010074389" -> (known after apply)
        tags                                 = {
            "Name" = "APP-SERVER"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-009f3bf5545a03f6b",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-00496c0c809b99903" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_instance.db must be replaced
-/+ resource "aws_instance" "db" {
      ~ ami                                  = "ami-066841d983164f7f6" -> "ami-02d8f13fe48708be8" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-1:294268556398:instance/i-0411a891660e3d4da" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "eu-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0411a891660e3d4da" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-01066919b0c75b4c1" -> (known after apply)
      ~ private_dns                          = "ip-172-16-2-53.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.16.2.53" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "DB-SERVER"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0bde1051505fb0eb8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ash-ley, Action: `pull_request`, Working Directory: ` onprem/ `, Workflow: `Terraform Validation`*